ЛИС2/src/Catalogs/Водозаборы/Водозаборы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Водозаборы</name>
  <comment>В справочнике содержатся сведения об источниках водозабора предприятия.</comment>
  <attributes>
    <name>ПроектнаяПроизводительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВведенияВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭксплуатируетсяВНастоящееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыСевернойШироты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыВосточнойДолготы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодныйОбъект</name>
    <type>
      <types>DefinedType.ИсточникиПриемникиВод</types>
    </type>
  </attributes>
  <attributes>
    <name>РасстояниеОтУстья</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияКачестваВоды</name>
    <type>
      <types>CatalogRef.КатегорииКачестваВоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидВодВодозабора</name>
    <type>
      <types>EnumRef.Удалить_ВидВодВодозабораВыпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>МуниципальныйРайон</name>
    <type>
      <types>CatalogRef.ОКТМО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКАТО</name>
    <type>
      <types>CatalogRef.ОКАТО</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТипаИсточникаПриемника</name>
    <type>
      <types>CatalogRef.КодыТипыИсточниковПриемников</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодохозяйственныйУчасток</name>
    <type>
      <types>CatalogRef.ВодохозяйственныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственнаяПлощадка</name>
    <type>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>СобственностьСтороннейОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПунктыНаблюденияТочкиЗамера</name>
    <attributes>
      <name>НомерСтвора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоордСевШир</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоордВостДолг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресПунктаЗамера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПриборыВодоучета</name>
    <attributes>
      <name>ПриборУчетаВоды</name>
      <type>
        <types>CatalogRef.ПриборыУчетаИспользованияВоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Catalogs/КодыТипыИсточниковПриемников/КодыТипыИсточниковПриемников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КодыТипыИсточниковПриемников</name>
  <comment>В справочнике содержится перечень кодов и типов источников/приемников воды согласно Приложению №1 приказа Росстата от 19.10.2009 N 230 (ред. от 28.11.2011, с изм. от 05.05.2016)</comment>
  <predefined>
    <items>
      <name>Болото</name>
      <description>Болото</description>
    </items>
    <items>
      <name>ВодохранилищеНаливноеПрудНаливной</name>
      <description>Водохранилище наливное, пруд наливной</description>
    </items>
    <items>
      <name>ВодохранилищеРусловоеПрудРусловой</name>
      <description>Водохранилище русловое, пруд русловой</description>
    </items>
    <items>
      <name>ЗемледельческиеПоляОрошения</name>
      <description>Земледельческие поля орошения</description>
    </items>
    <items>
      <name>КаналКомплексногоНазначения</name>
      <description>Канал комплексного назначения</description>
    </items>
    <items>
      <name>КоллекторОросительнойСистемы</name>
      <description>Коллектор оросительной системы</description>
    </items>
    <items>
      <name>ЛивневойКоллектор</name>
      <description>Ливневой коллектор</description>
    </items>
    <items>
      <name>Море</name>
      <description>Море</description>
    </items>
    <items>
      <name>Накопитель</name>
      <description>Накопитель</description>
    </items>
    <items>
      <name>Озеро</name>
      <description>Озеро</description>
    </items>
    <items>
      <name>ПодземныйВодныйОбъект</name>
      <description>Подземный водный объект</description>
    </items>
    <items>
      <name>ПоляФильтрации</name>
      <description>Поля фильтрации</description>
    </items>
    <items>
      <name>Река</name>
      <description>Река</description>
    </items>
    <items>
      <name>РекаПересыхающая</name>
      <description>Река пересыхающая</description>
    </items>
    <items>
      <name>РельефМестности</name>
      <description>Рельеф местности</description>
    </items>
    <items>
      <name>СетьКанализации</name>
      <description>Сеть канализации</description>
    </items>
    <items>
      <name>СкважинаВертикальнаяУровняГрунтовыхВод</name>
      <description>Скважина вертикального дренажа для понижения уровня грунтовых вод</description>
    </items>
    <items>
      <name>ШахтаРудникНефтепромыселКарьер</name>
      <description>Шахта, рудник, нефтепромысел, карьер</description>
    </items>
  </predefined>
</mdclass:Catalog>

ЛИС2/src/Catalogs/КатегорииКачестваВоды/КатегорииКачестваВоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииКачестваВоды</name>
  <comment>В справочнике содержится перечень кодов категорий качества воды согласно Приложению №2 приказа Росстата от 19.10.2009 N 230 (ред. от 28.11.2011, с изм. от 05.05.2016)</comment>
  <predefined>
    <items>
      <name>БалластнаяЛьяльная</name>
      <description>Балластная, льяльная</description>
    </items>
    <items>
      <name>ВПрочихСистемахВодоотведения</name>
      <description>В прочих системах водоотведения</description>
    </items>
    <items>
      <name>ВСистемахВодоотведенияКоммунальногоНазначения</name>
      <description>В системах водоотведения коммунального назначения</description>
    </items>
    <items>
      <name>ВодаСточнаяТранзитная</name>
      <description>Вода сточная транзитная, переданная на очистные сооружения другим респондентам</description>
    </items>
    <items>
      <name>ЗабраннаяИзПриродныхВодныхОбъектовКромеМорей</name>
      <description>Забранная из природных водных объектов (кроме морей)</description>
    </items>
    <items>
      <name>ЗабраннаяИЗПриродныхВОКромеМорейВТомЧислеПослеВодоподготовки</name>
      <description>Забранная из природных водных объектов (кроме морей), в том числе после водоподготовки</description>
    </items>
    <items>
      <name>ИзМорей</name>
      <description>Из морей</description>
    </items>
    <items>
      <name>Карьерная</name>
      <description>Карьерная</description>
    </items>
    <items>
      <name>КоллекторноДренажная</name>
      <description>Коллекторно-дренажная</description>
    </items>
    <items>
      <name>Ливневая</name>
      <description>Ливневая</description>
    </items>
    <items>
      <name>Минеральная</name>
      <description>Минеральная</description>
    </items>
    <items>
      <name>ПереданнаяДляПерераспределенияПереброскиСтока</name>
      <description>Переданная для перераспределения (переброски) стока</description>
    </items>
    <items>
      <name>ПереданнаяДляПополненияЗапасовПодземныхВод</name>
      <description>Переданная для пополнения запасов подземных вод</description>
    </items>
    <items>
      <name>ПолученнаяПереданнаяИзПрочихСистемВодоснабжения</name>
      <description>Полученная и (или) переданная из прочих систем водоснабжения</description>
    </items>
    <items>
      <name>ПолученнаяПереданнаяИзСистемВодоснабженияВодообеспеченияОбводнения</name>
      <description>Полученная и (или) переданная из систем водоснабжения (водообеспечения, обводнения)</description>
    </items>
    <items>
      <name>ПолученнаяПереданнаяИзСистемВодоснабженияКоммунальногоНазначения</name>
      <description>Полученная и (или) переданная из систем водоснабжения коммунального назначения</description>
    </items>
    <items>
      <name>СброснаяСРисовыхСистем</name>
      <description>Сбросная с рисовых систем</description>
    </items>
    <items>
      <name>СброснаяСРыбоводныхПрудов</name>
      <description>Сбросная с рыбоводных прудов</description>
    </items>
    <items>
      <name>Термальная</name>
      <description>Термальная</description>
    </items>
    <items>
      <name>ШахтноРудничная</name>
      <description>Шахтно-рудничная</description>
    </items>
  </predefined>
</mdclass:Catalog>

ЛИС2/src/Catalogs/Водозаборы/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;		

	// Работа с бизнес-процессами
	Если Обработки.СозданиеНСИ.ИспользоватьМеханизмБизнесПроцессов( Ссылка ) Тогда
		Обработки.СозданиеНСИ.ЗапуститьБизнесПроцессСогласования( Ссылка );
	КонецЕсли;

КонецПроцедуры

Процедура ПередУдалением(Отказ)

// 1СКСУ - Казанцев И.В. 19.01.17 11:15
// При провере АПК не обнаружена конструкция "Если ОбменДанными.Загрузка Тогда ...".
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли; 
// 1СКСУ - Казанцев И.В. 19.01.17 11:15 Конец

	
	// Работа с бизнес-процессами
	Если Обработки.СозданиеНСИ.ИспользоватьМеханизмБизнесПроцессов( Ссылка ) Тогда
		Если Не Обработки.СозданиеНСИ.ЭлементДоступенДляРедактирования( Ссылка ) Тогда
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СписокВидовВодныхОбъектовУстье = Справочники.Водозаборы.ПолучитьСписокВидовВодныхОбъектовРасстояниеДоУстья();
	
	Если СписокВидовВодныхОбъектовУстье.Найти(КодТипаИсточникаПриемника) <> Неопределено Тогда 
		ПроверяемыеРеквизиты.Добавить("РасстояниеОтУстья");
	КонецЕсли; // Если СписокВидовВодныхОбъектовУстье.Найти(КодТипаИсточникаВодоснабжения) <> Неопределено Тогда
	
	Если КодТипаИсточникаПриемника <> ПредопределенноеЗначение("Справочник.КодыТипыИсточниковПриемников.ЛивневойКоллектор") Тогда 
		ПроверяемыеРеквизиты.Добавить("ВодныйОбъект");		
	КонецЕсли; // Если КодТипаИсточникаПриемника <> ПредопределенноеЗначение("Справочник.КодыТипыИсточниковПриемников.ЛивневойКоллектор") Тогда 
	
	Если (КатегорияКачестваВоды = ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.Минеральная") Или 
		КатегорияКачестваВоды = ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.Термальная")) И 
		(КодТипаИсточникаПриемника <> ПредопределенноеЗначение("Справочник.КодыТипыИсточниковПриемников.ПодземныйВодныйОбъект") И 
		КодТипаИсточникаПриемника <> ПредопределенноеЗначение("Справочник.КодыТипыИсточниковПриемников.ШахтаРудникНефтепромыселКарьер")) Тогда 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранной категории качества воды код типа источника должен быть равен 60 или 61", 
		ЭтотОбъект,"КодТипаИсточникаПриемника",, Отказ);
		
	ИначеЕсли КатегорияКачестваВоды = ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.Ливневая") И 
		КодТипаИсточникаПриемника <> ПредопределенноеЗначение("Справочник.КодыТипыИсточниковПриемников.ЛивневойКоллектор") Тогда 	
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранной категории качества воды код типа источника должен быть равен 99", 
		ЭтотОбъект,"КодТипаИсточникаПриемника",, Отказ);
		
	ИначеЕсли (КатегорияКачестваВоды = ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.ШахтноРудничная") Или
		КатегорияКачестваВоды = ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.Карьерная")) И 
		КодТипаИсточникаПриемника <> ПредопределенноеЗначение("Справочник.КодыТипыИсточниковПриемников.ШахтаРудникНефтепромыселКарьер") Тогда 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранной категории качества воды код типа источника должен быть равен 61", 
		ЭтотОбъект,"КодТипаИсточникаПриемника",, Отказ);		
		
	ИначеЕсли КатегорияКачестваВоды = ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.КоллекторноДренажная") И
		КодТипаИсточникаПриемника <> ПредопределенноеЗначение("Справочник.КодыТипыИсточниковПриемников.СкважинаВертикальнаяУровняГрунтовыхВод") И 
		КодТипаИсточникаПриемника <> ПредопределенноеЗначение("Справочник.КодыТипыИсточниковПриемников.КоллекторОросительнойСистемы") Тогда 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранной категории качества воды код типа источника должен быть равен 62 или 71", 
		ЭтотОбъект,"КодТипаИсточникаПриемника",, Отказ);
		
	КонецЕсли; // Если (КатегорияКачестваВоды = ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.Минеральная") Или  
		
КонецПроцедуры

#КонецОбласти
